MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAG176/mcu.h
#define _SBT1RD2_GROUP2_POSITION                 0x00000002
#define _SBT1RD2_GROUP2_MASK                     0x00000004
#define _SBT1RD2_GROUP2_LENGTH                   0x00000001

#define _SBT1RD2_GROUP3_POSITION                 0x00000003
#define _SBT1RD2_GROUP3_MASK                     0x00000008
#define _SBT1RD2_GROUP3_LENGTH                   0x00000001

#define _SBT1WR2_GROUP0_POSITION                 0x00000000
#define _SBT1WR2_GROUP0_MASK                     0x00000001
#define _SBT1WR2_GROUP0_LENGTH                   0x00000001

#define _SBT1WR2_GROUP1_POSITION                 0x00000001
#define _SBT1WR2_GROUP1_MASK                     0x00000002
#define _SBT1WR2_GROUP1_LENGTH                   0x00000001

#define _SBT1WR2_GROUP2_POSITION                 0x00000002
#define _SBT1WR2_GROUP2_MASK                     0x00000004
#define _SBT1WR2_GROUP2_LENGTH                   0x00000001

#define _SBT1WR2_GROUP3_POSITION                 0x00000003
#define _SBT1WR2_GROUP3_MASK                     0x00000008
#define _SBT1WR2_GROUP3_LENGTH                   0x00000001

#define _SBT1REG3_SIZE_POSITION                  0x00000003
#define _SBT1REG3_SIZE_MASK                      0x000000F8
#define _SBT1REG3_SIZE_LENGTH                    0x00000005

#define _SBT1REG3_PRI_POSITION                   0x00000009
#define _SBT1REG3_PRI_MASK                       0x00000200
#define _SBT1REG3_PRI_LENGTH                     0x00000001

#define _SBT1REG3_BASE_POSITION                  0x0000000A
#define _SBT1REG3_BASE_MASK                      0xFFFFFC00
#define _SBT1REG3_BASE_LENGTH                    0x00000016

#define _SBT1RD3_GROUP0_POSITION                 0x00000000
#define _SBT1RD3_GROUP0_MASK                     0x00000001
#define _SBT1RD3_GROUP0_LENGTH                   0x00000001

#define _SBT1RD3_GROUP1_POSITION                 0x00000001
#define _SBT1RD3_GROUP1_MASK                     0x00000002
#define _SBT1RD3_GROUP1_LENGTH                   0x00000001

#define _SBT1RD3_GROUP2_POSITION                 0x00000002
#define _SBT1RD3_GROUP2_MASK                     0x00000004
#define _SBT1RD3_GROUP2_LENGTH                   0x00000001

#define _SBT1RD3_GROUP3_POSITION                 0x00000003
#define _SBT1RD3_GROUP3_MASK                     0x00000008
#define _SBT1RD3_GROUP3_LENGTH                   0x00000001

#define _SBT1WR3_GROUP0_POSITION                 0x00000000
#define _SBT1WR3_GROUP0_MASK                     0x00000001
#define _SBT1WR3_GROUP0_LENGTH                   0x00000001

#define _SBT1WR3_GROUP1_POSITION                 0x00000001
#define _SBT1WR3_GROUP1_MASK                     0x00000002
#define _SBT1WR3_GROUP1_LENGTH                   0x00000001

#define _SBT1WR3_GROUP2_POSITION                 0x00000002
#define _SBT1WR3_GROUP2_MASK                     0x00000004
#define _SBT1WR3_GROUP2_LENGTH                   0x00000001

#define _SBT1WR3_GROUP3_POSITION                 0x00000003
#define _SBT1WR3_GROUP3_MASK                     0x00000008
#define _SBT1WR3_GROUP3_LENGTH                   0x00000001

#define _SBT1REG4_SIZE_POSITION                  0x00000003
#define _SBT1REG4_SIZE_MASK                      0x000000F8
#define _SBT1REG4_SIZE_LENGTH                    0x00000005

#define _SBT1REG4_PRI_POSITION                   0x00000009
#define _SBT1REG4_PRI_MASK                       0x00000200
#define _SBT1REG4_PRI_LENGTH                     0x00000001

#define _SBT1REG4_BASE_POSITION                  0x0000000A
#define _SBT1REG4_BASE_MASK                      0xFFFFFC00
#define _SBT1REG4_BASE_LENGTH                    0x00000016

#define _SBT1RD4_GROUP0_POSITION                 0x00000000
#define _SBT1RD4_GROUP0_MASK                     0x00000001
#define _SBT1RD4_GROUP0_LENGTH                   0x00000001

#define _SBT1RD4_GROUP1_POSITION                 0x00000001
#define _SBT1RD4_GROUP1_MASK                     0x00000002
#define _SBT1RD4_GROUP1_LENGTH                   0x00000001

#define _SBT1RD4_GROUP2_POSITION                 0x00000002
#define _SBT1RD4_GROUP2_MASK                     0x00000004
#define _SBT1RD4_GROUP2_LENGTH                   0x00000001

#define _SBT1RD4_GROUP3_POSITION                 0x00000003
#define _SBT1RD4_GROUP3_MASK                     0x00000008
#define _SBT1RD4_GROUP3_LENGTH                   0x00000001

#define _SBT1WR4_GROUP0_POSITION                 0x00000000
#define _SBT1WR4_GROUP0_MASK                     0x00000001
#define _SBT1WR4_GROUP0_LENGTH                   0x00000001

#define _SBT1WR4_GROUP1_POSITION                 0x00000001
#define _SBT1WR4_GROUP1_MASK                     0x00000002
#define _SBT1WR4_GROUP1_LENGTH                   0x00000001

#define _SBT1WR4_GROUP2_POSITION                 0x00000002
#define _SBT1WR4_GROUP2_MASK                     0x00000004
#define _SBT1WR4_GROUP2_LENGTH                   0x00000001

#define _SBT1WR4_GROUP3_POSITION                 0x00000003
#define _SBT1WR4_GROUP3_MASK                     0x00000008
#define _SBT1WR4_GROUP3_LENGTH                   0x00000001

#define _SBT1REG5_SIZE_POSITION                  0x00000003
#define _SBT1REG5_SIZE_MASK                      0x000000F8
#define _SBT1REG5_SIZE_LENGTH                    0x00000005

#define _SBT1REG5_PRI_POSITION                   0x00000009
#define _SBT1REG5_PRI_MASK                       0x00000200
#define _SBT1REG5_PRI_LENGTH                     0x00000001

#define _SBT1REG5_BASE_POSITION                  0x0000000A
#define _SBT1REG5_BASE_MASK                      0xFFFFFC00
#define _SBT1REG5_BASE_LENGTH                    0x00000016

#define _SBT1RD5_GROUP0_POSITION                 0x00000000
#define _SBT1RD5_GROUP0_MASK                     0x00000001
#define _SBT1RD5_GROUP0_LENGTH                   0x00000001

#define _SBT1RD5_GROUP1_POSITION                 0x00000001
#define _SBT1RD5_GROUP1_MASK                     0x00000002
#define _SBT1RD5_GROUP1_LENGTH                   0x00000001

#define _SBT1RD5_GROUP2_POSITION                 0x00000002
#define _SBT1RD5_GROUP2_MASK                     0x00000004
#define _SBT1RD5_GROUP2_LENGTH                   0x00000001

#define _SBT1RD5_GROUP3_POSITION                 0x00000003
#define _SBT1RD5_GROUP3_MASK                     0x00000008
#define _SBT1RD5_GROUP3_LENGTH                   0x00000001

#define _SBT1WR5_GROUP0_POSITION                 0x00000000
#define _SBT1WR5_GROUP0_MASK                     0x00000001
#define _SBT1WR5_GROUP0_LENGTH                   0x00000001

#define _SBT1WR5_GROUP1_POSITION                 0x00000001
#define _SBT1WR5_GROUP1_MASK                     0x00000002
#define _SBT1WR5_GROUP1_LENGTH                   0x00000001

